IDEA Open Model
Point2D.X Property
Compatible with IDEA StatiCa 20.1
 Gets or sets the X-coordinate value
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public double X { get; set; }
Public Property X As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Point2D Class
IdeaRS.OpenModel.Geometry2D Namespace